In [1]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88],
      'Grades':['AA','AB','CC','BB','AA','AA','BB']}
df=pd.DataFrame(dict,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

         Name  Marks Grades
stu1     King     90     AA
stu2    Queen     89     AB
stu3  Pricess     80     CC
stu4   Prince     88     BB
stu5    Diana     90     AA
stu6  William     98     AA
stu7    Georg     88     BB

## Filtering the data without using loc, iloc

#### 1. Students having marks greater than 90

In [2]:
x=df['Marks']>90

In [3]:
df[x]

         Name  Marks Grades
stu6  William     98     AA

In [5]:
# other ways
df[df['Marks']>90]

         Name  Marks Grades
stu6  William     98     AA

#### 2. Students having "AB" grade

In [7]:
df[df['Grades']=='AB']

       Name  Marks Grades
stu2  Queen     89     AB

#### 3. Students having Marks greater than 80 and having "AB" Grade

In [8]:
df[(df['Marks']>80) & (df['Grades']=="AB")]

       Name  Marks Grades
stu2  Queen     89     AB

#### 4. Name of the students having marks greater than 90

In [10]:
df[df['Marks']>90]['Name']

stu6    William
Name: Name, dtype: object

#### 5. Name of the students having "AB" Grades

In [11]:
df[df['Grades']=="AB"]['Name']

stu2    Queen
Name: Name, dtype: object

## Exercises

#### loc:Access a group of rows and columns by label(s) or a boolean array

#### 6. Students having marks greater than 90[loc]

In [17]:
df.loc[df['Marks']>90]

         Name  Marks Grades
stu6  William     98     AA

#### 7.Students having Marks greater than 80 and having "AB" Grade [loc]

In [19]:
df.loc[(df['Marks']>80) & (df['Grades']=="AB")]

       Name  Marks Grades
stu2  Queen     89     AB

#### 8.Studens having marks greater than 90 [iloc]

In [21]:
df[df.iloc[:,1]>90]

         Name  Marks Grades
stu6  William     98     AA

#### 9. Students having Marks greater than 80 and having "AB" Grade [iloc]

In [22]:
df[(df.iloc[:,1]>80) & (df.iloc[:,2]=="AB")]

       Name  Marks Grades
stu2  Queen     89     AB

#### 10. Name of the students having "AB" Grade [iloc]

In [23]:
df[df.iloc[:,2]=="AB"]['Name']

stu2    Queen
Name: Name, dtype: object